# Brewfile - Core CLI Tools
# Usage: brew bundle --file=Brewfile
# These are always installed on a new Mac

# Shell & Terminal
brew "fish"
brew "tmux"
brew "starship"

# Core CLI
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "tree"

# Modern CLI replacements
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # rg - faster grep
brew "fd"           # Faster find
brew "zoxide"       # z - smarter cd
brew "bat"          # Better cat
brew "eza"          # Better ls
brew "git-delta"    # Better git diff

# Data tools
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "dasel"        # Multi-format data tool
brew "jless"        # JSON viewer

# Dev utilities
brew "lazygit"      # Git TUI
brew "lazydocker"   # Docker TUI
brew "btop"         # System monitor
brew "dust"         # Disk usage visualizer
brew "procs"        # Modern ps replacement
brew "direnv"       # Directory-based env vars
brew "gnupg"        # GPG encryption
brew "neovim"       # Editor
brew "mas"          # Mac App Store CLI

# Shell utilities
brew "gum"          # Glamorous shell scripts (spinners, prompts)
brew "glow"         # Terminal markdown renderer

# File management
brew "lf"           # Terminal file manager (vim-like)

# Node ecosystem
brew "fnm"          # Fast Node Manager
brew "deno"         # Secure JS/TS runtime
brew "ni"           # Universal package manager (auto-detects npm/yarn/pnpm/bun)
# bun: Install via curl -fsSL https://bun.com/install | bash
